targetName=a9
arch=arm
runHost=10.0.6.38
runHostPrompt=*$* 
target=10.0.6.39
targetRoot=/usr/local/arm-sony-linux-gnueabi/target/armv7a
rpmDir=/home/rpmuser/rpm
testSoucreDir=/home/rpmuser//MAIN/dist/pkg
rpmBuild=/home/rpmuser/MAIN/dist/pkg/sony-rpmbuild
rpmBuildPatch=/home/rpmuser///MAIN/dist/pkg/sony-rpmbuild -p
hddDev=sda
device=sda1
cmplrs=/home/rpmuser/MAIN/cmplrs
triplet=arm-sony-linux-gnueabi
dialect=armv7a
currentHost=10.0.6.38
majorVersion=11
withoutsslibcFlag=yes
targetTop=/usr/local/arm-sony-linux-gnueabi
tempDir=/home/rpmuser/rpm/tmp
dwarves : 1.10
spawn -nottyinit rpm -ivh /home/rpmuser/CE-Linux-11.0.0.0-RC1/Tools_Userland/SRPMS/sony-target-devtool-dwarves-1.10-11000001.src.rpm
rpm: RPM should not be used directly install RPM packages, use Alien instead!
rpm: However assuming you know what you are doing...
   1:sony-target-devtool-dwawarning: group rpmuser does not exist - using root
                                            (  6%)#                                           (  6%)##                                          (  6%)warning: group rpmuser does not exist - using root

  -d, --recursive            recursive mode, affects several other flags
  -D, --decl_exclude=PREFIX  exclude classes declared in files with PREFIX
  -E, --expand_types         expand class members
  -f, --find_pointers_to=CLASS_NAME
                             Find pointers to CLASS_NAME
      --first_obj_only       Only process the first object file in the binary
      --fixup_silly_bitfields   Fix silly bitfields such as int foo:32
      --flat_arrays          Flat arrays
  -F, --format_path=FORMAT_LIST   List of debugging formats to try
      --hex                  Print offsets and sizes in hexadecimal
  -H, --holes=NR_HOLES       show only structs with at least NR_HOLES holes
  -i, --contains=CLASS_NAME  Show classes that contains CLASS_NAME
  -I, --show_decl_info       Show the file and line number where the tags were
                             defined
  -l, --show_first_biggest_size_base_type_member
                             show first biggest size base_type member
  -m, --nr_methods           show number of methods
  -M, --show_only_data_members   show only the members that use space in the
                             class layout
  -n, --nr_members           show number of members
  -N, --class_name_len       show size of classes
  -p, --expand_pointers      expand class pointer members
  -P, --packable             show only structs that has holes that can be
                             packed
  -q, --quiet                be quieter
  -r, --rel_offset           show relative offsets of members in inner structs
  -R, --reorganize           reorg struct trying to kill holes
  -s, --sizes                show size of classes
      --show_private_classes Show classes that are defined inside other classes
                             or in functions
  -S, --show_reorg_steps     show the struct layout at each reorganization
                             step
  -t, --separator=SEP        use SEP as the field separator
  -T, --nr_definitions       show how many times struct was defined
  -u, --defined_in           show CUs where CLASS_NAME (-C) is defined
  -V, --verbose              be verbose
  -w, --word_size=WORD_SIZE  change the arch word size to WORD_SIZE
  -x, --exclude=PREFIX       exclude PREFIXed classes
  -X, --cu_exclude=PREFIX    exclude PREFIXed compilation units
  -y, --prefix_filter=PREFIX include PREFIXed classes
  -z, --hole_size_ge=HOLE_SIZE   show only structs with at least one hole
                             greater or equal to HOLE_SIZE
  -Z, --ctf_encode           Encode as CTF
  -?, --help                 Give this help list
      --usage                Give a short usage message
      --version              Print program version

Mandatory or optional arguments to long options are also mandatory or optional
for any corresponding short options.
help_test : PASS
-------------------------------------------------------------
struct inner {
        long int *                 a;                    /*     0     4 */

        /* size: 4, cachelines: 1, members: 1 */
        /* last cacheline: 4 bytes */
};
struct foo {
        int                        xx;                   /*     0     4 */
        char                       yy;                   /*     4     1 */

        /* XXX 3 bytes hole, try to pack */

        struct inner               in;                   /*     8     4 */
        float                      zz;                   /*    12     4 */

        /* size: 16, cachelines: 1, members: 4 */
        /* sum members: 13, holes: 1, sum holes: 3 */
        /* last cacheline: 16 bytes */
};
struct foo1 {
        struct foo                 ptr;                  /*     0    16 */
        unsigned int               xxx;                  /*    16     4 */

        /* XXX 4 bytes hole, try to pack */

        double                     yyy;                  /*    24     8 */

        /* size: 32, cachelines: 1, members: 3 */
        /* sum members: 28, holes: 1, sum holes: 4 */
        /* last cacheline: 32 bytes */
};
basic_test : PASS
-------------------------------------------------------------
inner   4       0
foo     16      1
foo1    32      1
size_option_test : PASS
-------------------------------------------------------------
foo1
hole_test : PASS
-------------------------------------------------------------
inner   1
foo     1
foo1    1
N_times_struct_defined_test : PASS
-------------------------------------------------------------
inner   1
foo     4
foo1    3
number_of_arguments_test : PASS
-------------------------------------------------------------
struct inner {
        long int *                 a;                    /*     0     4 */

        /* size: 4, cachelines: 1, members: 1 */
        /* last cacheline: 4 bytes */
        /* first biggest size base type member: a 0 4 */
};
struct foo {
        int                        xx;                   /*     0     4 */
        char                       yy;                   /*     4     1 */

        /* XXX 3 bytes hole, try to pack */

        struct inner               in;                   /*     8     4 */
        float                      zz;                   /*    12     4 */

        /* size: 16, cachelines: 1, members: 4 */
        /* sum members: 13, holes: 1, sum holes: 3 */
        /* last cacheline: 16 bytes */
        /* first biggest size base type member: xx 0 4 */
};
struct foo1 {
        struct foo                 ptr;                  /*     0    16 */
        unsigned int               xxx;                  /*    16     4 */

        /* XXX 4 bytes hole, try to pack */

        double                     yyy;                  /*    24     8 */

        /* size: 32, cachelines: 1, members: 3 */
        /* sum members: 28, holes: 1, sum holes: 4 */
        /* last cacheline: 32 bytes */
        /* first biggest size base type member: xx 0 4 */
};
biggest_member_test : PASS
-------------------------------------------------------------
struct inner {
        long int *                 a;                                                    /*     0     4 */

        /* size: 4, cachelines: 1, members: 1 */
        /* last cacheline: 4 bytes */
};
struct foo {
        int                        xx;                                                   /*     0     4 */
        char                       yy;                                                   /*     4     1 */

        /* XXX 3 bytes hole, try to pack */

        struct inner {
                long int *         a;                                                    /*     8     4 */
        } in; /*     8     4 */
        float                      zz;                                                   /*    12     4 */

        /* size: 16, cachelines: 1, members: 4 */
        /* sum members: 13, holes: 1, sum holes: 3 */
        /* last cacheline: 16 bytes */
};
struct foo1 {
        struct foo {
                int                xx;                                                   /*     0     4 */
                char               yy;                                                   /*     4     1 */

                /* XXX 3 bytes hole, try to pack */

                struct inner {
                        long int * a;                                                    /*     8     4 */
                } in; /*     8     4 */
                float              zz;                                                   /*    12     4 */
        } ptr; /*     0    16 */
        unsigned int               xxx;                                                  /*    16     4 */

        /* XXX 4 bytes hole, try to pack */

        double                     yyy;                                                  /*    24     8 */

        /* size: 32, cachelines: 1, members: 3 */
        /* sum members: 28, holes: 1, sum holes: 4 */
        /* last cacheline: 32 bytes */
};
expanded_structure_test : PASS
-------------------------------------------------------------
struct inner {
        long int *                 a;
};
struct foo {
        int                        xx;
        char                       yy;
        struct inner               in;
        float                      zz;
};
struct foo1 {
        struct foo                 ptr;
        unsigned int               xxx;
        double                     yyy;
};
quieter_test : PASS
-------------------------------------------------------------
struct inner {
        long int                   *a;                   /*     0     4 */

        /* size: 4, cachelines: 1, members: 1 */
        /* last cacheline: 4 bytes */
};
struct foo {
        int                        xx;                   /*     0     4 */
        char                       yy;                   /*     4     1 */

        /* XXX 3 bytes hole, try to pack */

        struct inner               in;                   /*     8     4 */
        float                      zz;                   /*    12     4 */

        /* size: 16, cachelines: 1, members: 4 */
        /* sum members: 13, holes: 1, sum holes: 3 */
        /* last cacheline: 16 bytes */
};
struct foo1 {
        struct foo                 ptr;                  /*     0    16 */
        unsigned int               xxx;                  /*    16     4 */

        /* XXX 4 bytes hole, try to pack */

        double                     yyy;                  /*    24     8 */

        /* size: 32, cachelines: 1, members: 3 */
        /* sum members: 28, holes: 1, sum holes: 4 */
        /* last cacheline: 32 bytes */
};
expand_pointers_test : PASS
-------------------------------------------------------------
/* <79> /tmp/dwarves-1.10/tests/test.c:6 */
struct inner {
        long int *                 a;                    /*     0     4 */

        /* size: 4, cachelines: 1, members: 1 */
        /* last cacheline: 4 bytes */
};
/* <98> /tmp/dwarves-1.10/tests/test.c:3 */
struct foo {
        int                        xx;                   /*     0     4 */
        char                       yy;                   /*     4     1 */

        /* XXX 3 bytes hole, try to pack */

        struct inner               in;                   /*     8     4 */
        float                      zz;                   /*    12     4 */

        /* size: 16, cachelines: 1, members: 4 */
        /* sum members: 13, holes: 1, sum holes: 3 */
        /* last cacheline: 16 bytes */
};
/* <e0> /tmp/dwarves-1.10/tests/test.c:12 */
struct foo1 {
        struct foo                 ptr;                  /*     0    16 */
        unsigned int               xxx;                  /*    16     4 */

        /* XXX 4 bytes hole, try to pack */

        double                     yyy;                  /*    24     8 */

        /* size: 32, cachelines: 1, members: 3 */
        /* sum members: 28, holes: 1, sum holes: 4 */
        /* last cacheline: 32 bytes */
};
show_decl_info_test : PASS

[32m TEST RESULT
  NO OF TEST EXECUTED : 12
  ALL TESTS SUCCESSFUL 
[0m
-bash-3.2# sending 10.0.6.38:/usr/local/arm-sony-linux-gnueabi/target/armv7a/tmp/dwarves_test.out to 10.0.6.38:/home/rpmuser/rpm/tmp....done
dwarves : TEST_OK
